In [1]:
import pandas as pd
import numpy as np

- How do you handle reading a large CSV file in chunks to mange memory using in pandas

In [2]:
df1 = pd.DataFrame({
    'emp_id': [1,2,3,4,5],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'age': [25,34,54,18,32],
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney'],
    'dept': ['HR', 'IT', 'Finance', 'HR', 'IT'],
    'join_date': ['2020-6-18', '2024-8-12', '2025-5-17', '2020-6-20', '2018-9-30']
})

In [3]:
# Save it as a CSV file
df1.to_csv('handle_lar_csv', index = 'False')

In [4]:
# Read the CSV in Chunks
for chunk in pd.read_csv('handle_lar_csv', chunksize = 2):
    print(chunk)
    print('----')

   Unnamed: 0  emp_id   name  age      city dept  join_date
0           0       1  Alice   25  New York   HR  2020-6-18
1           1       2    Bob   34    London   IT  2024-8-12
----
   Unnamed: 0  emp_id     name  age   city     dept  join_date
2           2       3  Charlie   54  Paris  Finance  2025-5-17
3           3       4    David   18  Tokyo       HR  2020-6-20
----
   Unnamed: 0  emp_id  name  age    city dept  join_date
4           4       5  Emma   32  Sydney   IT  2018-9-30
----

 - What is the difference between merge, join and concat in pandas? And when should you use each?
 - What do prefer a left, right, inner, outer join between two dataframe?

In [5]:
# Concat
df1 = pd.DataFrame({
    'index': [1, 2, 3],
    'name': ['Talha', 'Qasim', 'Hammad']
})
df2 = pd.DataFrame({
    'index': [4, 5],
    'name': ['Ali', 'Arham']
})
result = pd.concat([df1, df2], ignore_index=True)
print(result)

   index    name
0      1   Talha
1      2   Qasim
2      3  Hammad
3      4     Ali
4      5   Arham

In [6]:
# Inner Join
df1 = pd.DataFrame({
    'index': [1, 2, 3],
    'name': ['Talha', 'Qasim', 'Hammad']
})
df2 = pd.DataFrame({
    'index': [1, 2, 4, 5],
    'number': [55, 9, 6, 8]
})
result = pd.merge(df1, df2, on = 'index', how = 'inner')
print(result)

   index   name  number
0      1  Talha      55
1      2  Qasim       9

In [7]:
# Left Join    All rows from df1, scores added if id matches, else NaN.
df1 = pd.DataFrame({
    'index': [1, 2, 3],
    'name': ['Talha', 'Qasim', 'Hammad']
})
df2 = pd.DataFrame({
    'index': [1, 2, 4],
    'number': [55, 9, 6]
})
result = pd.merge(df1, df2, on = 'index', how = 'left')
print(result)

   index    name  number
0      1   Talha    55.0
1      2   Qasim     9.0
2      3  Hammad     NaN

In [8]:
# RIGHT JOIN  All rows from df2, names added if id matches, else NaN.
df1 = pd.DataFrame({
    'index': [1, 2, 3],
    'name': ['Talha', 'Qasim', 'Hammad']
})
df2 = pd.DataFrame({
    'index': [1, 2, 4],
    'number': [55, 9, 6]
})
result = pd.merge(df1, df2, on = 'index', how = 'right')
print(result)

   index   name  number
0      1  Talha      55
1      2  Qasim       9
2      4    NaN       6

In [9]:
# OUTER JOIN  All rows from both DataFrames (1, 2, 3, 4, 5, 6).
df1 = pd.DataFrame({
    'index': [1, 2, 3],
    'name': ['Talha', 'Qasim', 'Hammad']
})
df2 = pd.DataFrame({
    'index': [1, 2, 4],
    'number': [55, 9, 6]
})
result = pd.merge(df1, df2, on = 'index', how = 'outer')
print(result)

   index    name  number
0      1   Talha    55.0
1      2   Qasim     9.0
2      3  Hammad     NaN
3      4     NaN     6.0

- How can you pivot a dataframe to reshape it from long to wide format?

In [10]:
# Pivot a DataFrame
data = pd.DataFrame({
    'student': ['Sara', 'Alishba', 'Sara', 'Alishba'],
    'subject': ['Data Science', 'Data Science', 'Ai', 'Ai'],
    'marks': [10, 20,30,40]
})
result = data.pivot(index = 'student', columns = 'subject', values = 'marks')
print(result)

subject  Ai  Data Science
student
Alishba  40            20
Sara     30            10

- Use melt to transform a dataframe from wide to long format.

In [11]:
data = pd.DataFrame({
    "student": ["Ali", "Sara"],
    "Math": [90, 88],
    "Science": [85, 92]
})
melted = data.melt(id_vars=["student"], 
                 value_vars=["Math", "Science"], 
                 var_name="subject", 
                 value_name="marks")
print(melted)

  student  subject  marks
0     Ali     Math     90
1    Sara     Math     88
2     Ali  Science     85
3    Sara  Science     92

- How do you handle categorical data in a dataframe, and what are the benifit of using the categorical dtypes.

In [12]:
data = pd.DataFrame ({
    'Product': ['shirts', 'jeans', 'mobile', 'laptop', 'shoes', 'tablets'],
    'Category': ['clothes', 'clothes', 'electronics', 'electronics', 'clothes', 'electronics'],
    'Price': [2000,3000, 4000,5000,6000,7000]
})
data['Category'] = data['Category'].astype('category')
print(data.dtypes)

Product       object
Category    category
Price          int64
dtype: object

- Apply a function to every element in a dataframe using applymap.
- applymap is deprecated use only map

In [13]:
data = pd.DataFrame({
    'a': [1,2,3,4],
    'b': [5,6,7,8]
})
result = data.map(lambda x: x ** 2)
print(result)

    a   b
0   1  25
1   4  36
2   9  49
3  16  64

- How do use groupby with multiple column and agg using different function for each column.

In [14]:
data = pd.DataFrame({
    'city': ['Lahore', 'Lahore', 'Lahore', 'Isl'],
    'category': ['A', 'A', 'B', 'C'],
    'sales': [100, 200, 300, 400],
    'quantity': [2, 4, 3, 6]
})
print(data)

     city category  sales  quantity
0  Lahore        A    100         2
1  Lahore        A    200         4
2  Lahore        B    300         3
3     Isl        C    400         6

In [15]:
result = data.groupby(['city', 'category']).agg({
    'sales': 'sum',
    'quantity': 'sum'
})
print('This is multilndex')
print(result)

This is multilndex
                 sales  quantity
city   category
Isl    C           400         6
Lahore A           300         6
       B           300         3

- How do you create a multilndex Dataframe, and how do you select data from it.

In [16]:
print(result.loc['Lahore', 'A'])

sales       300
quantity      6
Name: (Lahore, A), dtype: int64

- How do you stack and unstack a dataframe with a multilndex.

In [17]:
data = pd.DataFrame({
    ('sales', 'Q1'): [100,200,300],
    ('sales', 'Q2'): [500,600,700],
    ('profit', 'Q1'): [1000,2000,3000],
    ('profit', 'Q2'): [5000,6000,7000],
}, index = ['store A', 'store B', 'store C'])
data

        sales      profit
           Q1   Q2     Q1    Q2
store A   100  500   1000  5000
store B   200  600   2000  6000
store C   300  700   3000  7000

In [18]:
result = data.stack(future_stack=True)
print(result)

            sales  profit
store A Q1    100    1000
        Q2    500    5000
store B Q1    200    2000
        Q2    600    6000
store C Q1    300    3000
        Q2    700    7000

In [19]:
result_1 = result.unstack()
print(result_1)

        sales      profit
           Q1   Q2     Q1    Q2
store A   100  500   1000  5000
store B   200  600   2000  6000
store C   300  700   3000  7000

- How do you use cut to bin numerical data into discrete interval.

In [20]:
marks = [35, 57, 79, 91, 10,95,59]
bins = [0,40,60,80,100]
labels = ['Fail', 'Average', 'Good', 'Excellent']
result = pd.cut(marks, bins=bins, labels=labels)
print(result)

['Fail', 'Average', 'Good', 'Excellent', 'Fail', 'Excellent', 'Average']
Categories (4, object): ['Fail' < 'Average' < 'Good' < 'Excellent']

- How do you use qcut to create quantile-based bins for a column.

In [21]:

# Exam scores of 12 students
scores = [35, 40, 42, 50, 55, 60, 65, 70, 75, 80, 85, 95]

# Split into 4 equal groups (quartiles)
result = pd.qcut(scores, q=4)

print(result)

[(34.999, 48.0], (34.999, 48.0], (34.999, 48.0], (48.0, 62.5], (48.0, 62.5], ..., (62.5, 76.25], (62.5, 76.25], (76.25, 95.0], (76.25, 95.0], (76.25, 95.0]]
Length: 12
Categories (4, interval[float64, right]): [(34.999, 48.0] < (48.0, 62.5] < (62.5, 76.25] < (76.25, 95.0]]

- How do you handle duplicate rows in a Dataframe, including finding and removing them.

In [22]:
data = pd.DataFrame({
    'name': ['Talha', 'Talha', 'Talha', 'Qasim', 'Hammad'],
    'age': [20, 30,40,18,19],
    'city': ['Lahore', 'Lahore', 'Lahore', 'isl', 'Karachi']
})

data

     name  age     city
0   Talha   20   Lahore
1   Talha   30   Lahore
2   Talha   40   Lahore
3   Qasim   18      isl
4  Hammad   19  Karachi

In [23]:
result = data.duplicated()
result

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [24]:
remove_duplicate = data.drop_duplicates()
remove_duplicate

     name  age     city
0   Talha   20   Lahore
1   Talha   30   Lahore
2   Talha   40   Lahore
3   Qasim   18      isl
4  Hammad   19  Karachi

In [25]:
data.drop_duplicates(keep = 'first')

     name  age     city
0   Talha   20   Lahore
1   Talha   30   Lahore
2   Talha   40   Lahore
3   Qasim   18      isl
4  Hammad   19  Karachi

In [26]:
data.drop_duplicates(keep = 'last')

     name  age     city
0   Talha   20   Lahore
1   Talha   30   Lahore
2   Talha   40   Lahore
3   Qasim   18      isl
4  Hammad   19  Karachi

In [27]:
data.drop_duplicates(keep = False)

     name  age     city
0   Talha   20   Lahore
1   Talha   30   Lahore
2   Talha   40   Lahore
3   Qasim   18      isl
4  Hammad   19  Karachi

- How do you replace a specific values in a dataframe with another value and nan.

In [28]:
data = pd.DataFrame({
    'name': ['Talha', 'Qasim', 'Maryam'],
    'age': [20, 15, 20]
})
data

     name  age
0   Talha   20
1   Qasim   15
2  Maryam   20

In [29]:
data['age'] = data['age'].replace(15, 'nan')
data

     name  age
0   Talha   20
1   Qasim  nan
2  Maryam   20

In [30]:
data['age'] = data['age'].replace({15: 16, 20: 21})
data

     name  age
0   Talha   21
1   Qasim  nan
2  Maryam   21

In [31]:
# conditional replacement with .loc
data.loc [data['name'] == 'Talha', 'age'] = 20
data

     name  age
0   Talha   20
1   Qasim  nan
2  Maryam   21

- How do you use str method to manipulate string data in a DataFrame column

In [32]:
data = pd.DataFrame({
    'name': ['Talha', 'Maryam', 'Qasim']
})
data

     name
0   Talha
1  Maryam
2   Qasim

In [33]:
data['name'].str.upper()

0     TALHA
1    MARYAM
2     QASIM
Name: name, dtype: object

In [34]:
data['name'].str.lower()

0     talha
1    maryam
2     qasim
Name: name, dtype: object

In [35]:
data['name'].str.title()

0     Talha
1    Maryam
2     Qasim
Name: name, dtype: object

In [36]:
data['name'].str.strip()    # Remove spaces at start & end
data['name'].str.lstrip()   # Remove left spaces
data['name'].str.rstrip()   # Remove right spaces

0     Talha
1    Maryam
2     Qasim
Name: name, dtype: object

In [37]:
data['name'].str.replace('Qasim', 'Arham')

0     Talha
1    Maryam
2     Arham
Name: name, dtype: object

In [38]:
# Extracting Substrings
data['name'].str[:3]

0    Tal
1    Mar
2    Qas
Name: name, dtype: object

- How do you parse dates when reading a CSV file into a DataFrame.

In [39]:
data = pd.read_csv('data.csv')

In [40]:
print(data.dtypes)

Index                 int64
Customer Id          object
First Name           object
Last Name            object
Company              object
City                 object
Country              object
Phone 1              object
Phone 2              object
Email                object
Subscription Date    object
Website              object
Numeric_Column        int64
dtype: object

In [41]:
data = pd.read_csv('data.csv', parse_dates = ['Subscription Date'], dayfirst=True)
print(data.dtypes)

Index                         int64
Customer Id                  object
First Name                   object
Last Name                    object
Company                      object
City                         object
Country                      object
Phone 1                      object
Phone 2                      object
Email                        object
Subscription Date    datetime64[ns]
Website                      object
Numeric_Column                int64
dtype: object

 - How do you convert a column to a day time type and extract componenets like year or date.

In [42]:
data = pd.read_csv('data.csv', parse_dates = ['Subscription Date'], dayfirst = True)
data

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website,Numeric_Column
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/,58
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/,62
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/,91
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,-9892,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/,41
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/,50
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/,20
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/,64
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/,83
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/,10
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/,98

In [43]:
# pandas gives you a special accessor .dt  it allows you to extract different components of the datetime.
data["Year"] = data["Subscription Date"].dt.year
data["Year"]

0     2020
1     2021
2     2020
3     2020
4     2021
      ...
95    2022
96    2021
97    2021
98    2021
99    2020
Name: Year, Length: 100, dtype: int32

In [44]:
data["Month"] = data["Subscription Date"].dt.month
print(data["Month"])

0     8
1     4
2     3
3     6
4     4
     ..
95    1
96    7
97    9
98    8
99    3
Name: Month, Length: 100, dtype: int32

 - How do you filter a dataframe based on a date range.

In [45]:
data = pd.read_csv('data.csv', parse_dates = ['Subscription Date'], dayfirst = True)
data

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website,Numeric_Column
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/,58
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/,62
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/,91
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,-9892,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/,41
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/,50
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/,20
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/,64
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/,83
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/,10
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/,98

In [46]:
start_data = '2021-04-17'
end_date =  '2022-01-30	'
filter_data = data[(data['Subscription Date'] >= start_data) & (data['Subscription Date'] <= end_date)]
print(filter_data)

    Index      Customer Id First Name  Last Name  \
1       2  1Ef7b82A4CAAD10    Preston     Lozano
4       5  053d585Ab6b3159     Joanna     Bender
6       7  EA4d384DfDbBf77     Darren       Peck
9      10  8C2811a503C7c5a   Michelle  Gallagher
10     11  216E205d6eBb815       Carl  Schroeder
12     13  e35426EbDEceaFF     Tracey       Mata
14     15  6fEaA1b7cab7B6C      Faith       Lutz
19     20  0F60FF3DdCd7aB0     Joanna       Kirk
20     21  9F9AdB7B8A6f7F2    Maxwell       Frye
30     31  64DCcDFaB9DFd4e       Jack       Tate
31     32  679c6c83DD872d6        Tom   Trujillo
32     33  7Ce381e4Afa4ba9    Gabriel      Mejia
33     34  A09AEc6E3bF70eE    Kaitlyn    Santana
34     35  aA9BAFfBc3710fe      Faith       Moon
35     36  E11dfb2DB8C9f72     Tammie      Haley
36     37  889eCf90f68c5Da   Nicholas       Sosa
38     39  dca4f1D0A0fc5c9      Bruce    Esparza
39     40  17aD8e2dB3df03D     Sherry      Garza
41     42  6e5ad5a5e2bB5Ca      Bryan       Dunn
44     45  30Dfa48fe5Ede78     Rhonda      Frost
49     50  80F33Fd2AcebF05     Latoya     Mccann
54     55  f3BEf3Be028166f      Robin       West
65     66  fF1b6c9E8Fbf1ff   Fernando    Lambert
74     75  D01Af0AF7cBbFeA     Regina      Stein
76     77  BF6a1f9bd1bf8DE   Brittany     Zuniga
80     81  D6CEAfb3BDbaa1A     Leslie   Jennings
81     82  Ebdb6F6F7c90b69   Kathleen      Mckay
83     84  78C06E9b6B3DF20       Chad   Davidson
91     92  98b3aeDcC3B9FF3      Shane      Foley
92     93  aAb6AFc7AfD0fF3     Collin      Ayers
95     96  cb8E23e48d22Eae       Karl      Greer
96     97  CeD220bdAaCfaDf       Lynn   Atkinson
97     98  28CDbC0dFe4b1Db       Fred     Guerra
98     99  c23d1D9EE8DEB0A     Yvonne     Farmer

                            Company               City  \
1                       Vega-Gentry  East Jimmychester
4          Martin, Lang and Andrade     West Priscilla
6      Lester, Woodard and Mitchell           Lake Ana
9                      Beck-Hendrix         Elaineberg
10       Oconnell, Meza and Everett       Shannonville
12                   Graham-Francis  South Joannamouth
14                   Carter-Hancock          Burchbury
19                   Mays-Mccormick         Jamesshire
20                    Patterson Inc         East Carly
30      Acosta, Petersen and Morrow        West Samuel
31                      Mcgee Group  Cunninghamborough
32                   Adkins-Salinas      Port Annatown
33                    Herrera Group        New Kaitlyn
34        Waters, Chase and Aguilar   West Marthaburgh
35       Palmer, Barnes and Houston        East Teresa
36                       Jordan Ltd       South Hunter
38                    Huerta-Mclean          Poolefurt
39                     Anderson Ltd          West John
41                 Kaufman and Sons      North Jimstad
44  Herrera, Shepherd and Underwood    Lake Lindaburgh
49       Hobbs, Garrett and Sanford    Port Sergiofort
54        Nixon, Blackwell and Sosa          Wallstown
65                     Church-Banks         Lake Nancy
74                     Guzman-Brown            Raystad
76                     Mason-Hester      West Reginald
80                Blankenship-Arias          Coreybury
81         Coffey, Lamb and Johnson     Lake Janiceton
83                   Garcia-Jimenez  South Joshuashire
91                       Rocha-Hart   South Dannymouth
92                    Lamb-Peterson       South Lonnie
95                        Carey LLC       East Richard
96            Ware, Burns and Oneal       New Bradview
97                    Schmitt-Jones         Ortegaland
98               Fitzgerald-Harrell    Lake Elijahview

                             Country                 Phone 1  \
1                           Djibouti              5153435776
4         Slovakia (Slovak Republic)  001-234-203-0635x76146
6                   Pitcairn Islands      (496)452-6181x3291
9                        Timor-Leste        739.218.2516x459
10                          Guernsey        637-854-0256x825
12                              Togo        001-949-844-8787
14                         Singapore      (781)861-7180x8306
19                  French Polynesia       (266)131-7001x711
20                             Malta            423.262.3059
30                          Zimbabwe      965-108-4406x20714
31                           Denmark            416-338-3758
32                     Liechtenstein              4077245425
33          United States of America              6303643286
34                           Bahamas    +1-586-217-0359x6317
35                            Belize   001-276-734-4113x6087
36                           Uruguay           (661)425-6042
38                        Montenegro            559-529-4424
39                            Poland    001-067-713-6440x158
41                      Burkina Faso        001-710-802-5565
44                            Monaco           (127)081-9339
49                           Belarus     (530)287-4548x29481
54                           Ecuador            698.303.4267
65                         Lithuania            497.829.9038
74                   Solomon Islands   001-469-848-0724x4407
76                   Kyrgyz Republic           (050)136-9025
80                        Micronesia            629.198.6346
81  Saint Vincent and the Grenadines           (733)910-9968
83                              Oman              8275702958
91                           Hungary                   -1692
92                          Anguilla        404-645-5351x012
95                            Guyana     (188)169-1674x58692
96                         Sri Lanka                   -3769
97                   Solomon Islands    +1-753-067-8419x7170
98                             Aruba           (530)311-9786

                   Phone 2                              Email  \
1         686-620-1820x944                    vmata@colon.com
4    001-199-446-3860x3486            colinalvarado@miles.net
6     +1-247-266-0963x4995                tgates@cantrell.com
9     001-054-401-0347x617                  mdyer@escobar.net
10        114.336.0784x788                 kirksalas@webb.com
12           (855)713-8773                   alex56@walls.org
14            207-185-3665  cassieparrish@blevins-chapman.net
19     (283)312-5579x11543            tuckerangie@salazar.net
20       202-880-0688x7491             fgibson@drake-webb.com
30       046.906.1442x6784         gfigueroa@boone-zavala.com
31           (775)890-7209               tapiagreg@beard.info
32      646.044.0696x66800             coleolson@jennings.net
33      447-710-6202x07313               georgeross@miles.org
34                   -2419     willistonya@randolph-baker.com
35           (430)300-8770           harrisisaiah@jenkins.com
36            975-998-1519                  fwolfe@dorsey.com
38   001-625-000-7132x0367               preese@frye-vega.com
39      (978)289-8785x5766                   ann48@miller.com
41      078.699.8982x13881          woodwardandres@phelps.com
44    +1-431-028-3337x3492           zkrueger@wolf-chavez.net
49      162-234-0249x32790               bobhammond@barry.biz
54    001-683-837-7651x525        greenemiranda@zimmerman.com
65              3863743398           fisherlinda@schaefer.net
74  001-085-360-4426x00357          zrosario@rojas-hardin.net
76   001-480-851-2496x0157       mchandler@cochran-huerta.org
80            075.256.0829                corey75@wiggins.com
81      (691)247-4128x0665  chloelester@higgins-wilkinson.com
83           (804)842-4715          justinwalters@jimenez.com
91  001-626-114-5844x55073                 nsteele@sparks.com
92   001-257-582-8850x8516           dudleyemily@gonzales.biz
95    001-841-293-3519x614                   hhart@jensen.com
96            605.413.3198                  vkemp@ferrell.com
97   +1-632-666-7507x92121                   swagner@kane.org
98  001-869-452-0943x12424     mccarthystephen@horn-green.biz

   Subscription Date                            Website  Numeric_Column
1         2021-04-23              http://www.hobbs.com/              62
4         2021-04-17        https://goodwin-ingram.com/              50
6         2021-08-24                https://www.le.com/              93
9         2021-11-08                 https://arias.com/              29
10        2021-10-20        https://simmons-hurley.com/              29
12        2021-12-02               http://www.beck.com/              72
14        2022-01-26              http://stevenson.org/              47
19        2021-09-24           https://www.camacho.net/              20
20        2022-01-12            http://www.roberts.com/              10
30        2021-09-15     http://www.hawkins-ramsey.com/              34
31        2022-01-13      http://www.daniels-klein.com/              27
32        2021-04-24         https://patel-hanson.info/              84
33        2021-09-21                   http://pham.com/              83
34        2021-11-03      https://spencer-charles.info/              67
35        2022-01-04            http://evans-simon.com/              41
36        2021-08-10  https://www.fleming-richards.com/              80
38        2021-10-22             http://www.farley.org/              42
39        2021-11-01                 http://spence.com/              32
41        2021-09-08             http://www.butler.com/              13
44        2021-12-06               http://www.khan.com/              10
49        2021-12-02            https://www.burton.com/              96
54        2022-01-13              https://www.mora.com/              44
65        2021-04-23              https://www.vang.com/              56
74        2022-01-15          http://www.johnston.info/              35
76        2021-07-24              http://www.boyle.com/              18
80        2021-11-13            https://www.juarez.com/              71
81        2021-09-12       http://www.owens-mooney.com/              85
83        2021-11-15      http://www.garner-oliver.com/              10
91        2021-07-06       https://www.holt-sparks.com/              93
92        2021-06-29               http://www.ruiz.com/              22
95        2022-01-30            http://hayes-perez.com/              20
96        2021-07-10         https://novak-allison.com/              64
97        2021-09-18              https://www.ross.com/              83
98        2021-08-11               http://watkins.info/              10

-  How do you resample time series data in a timeframe (e.g., from daily to mounthly).

In [47]:
data = pd.read_csv('data.csv', parse_dates = ['Subscription Date'], dayfirst = True)
index_1 = data.set_index("Subscription Date")
monthly_subs = index_1.resample("M")["Customer Id"].count()

print(monthly_subs)

Subscription Date
2020-01-31    2
2020-02-29    5
2020-03-31    3
2020-04-30    2
2020-05-31    1
2020-06-30    2
2020-07-31    4
2020-08-31    5
2020-09-30    4
2020-10-31    3
2020-11-30    3
2020-12-31    4
2021-01-31    4
2021-02-28    3
2021-03-31    5
2021-04-30    8
2021-05-31    0
2021-06-30    1
2021-07-31    3
2021-08-31    3
2021-09-30    6
2021-10-31    2
2021-11-30    5
2021-12-31    3
2022-01-31    7
2022-02-28    2
2022-03-31    4
2022-04-30    1
2022-05-31    5
Freq: ME, Name: Customer Id, dtype: int64

C:\Users\Talha\AppData\Local\Temp\ipykernel_16760\1339872714.py:3: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_subs = index_1.resample("M")["Customer Id"].count()

- How do you calculate of a rolling average for a column in a dataframe.

In [48]:
data = pd.DataFrame({
    'sales': [10,20,30,40,50,60]
})
data = data['sales'].rolling(window = 3).mean()
print(data)
# (10+20+30)/3
# (20+30+40)/3
# (30+40+50)/3
# (40+50+60)/3

0     NaN
1     NaN
2    20.0
3    30.0
4    40.0
5    50.0
Name: sales, dtype: float64

In [49]:
#Normal avg: "What is the one number that represents everything?"
#Rolling avg: "How is the trend moving step by step?"
data = pd.DataFrame({
    'Date': pd.date_range(start = '2025-01-01', periods = 7),
    'Temperature': [30, 32, 31, 29, 35, 36, 34]
})
data = data['Temperature'].rolling(window = 3).mean()
print(data)

0          NaN
1          NaN
2    31.000000
3    30.666667
4    31.666667
5    33.333333
6    35.000000
Name: Temperature, dtype: float64

- How do you use shift to create lagged or lead columns in a DataFrame?

In [50]:
# .shift() like moving the column up or down.
data = pd.DataFrame({
    "day": [1, 2, 3, 4, 5],
    "sales": [100, 120, 90, 150, 130]
})
data['yesterday_sales'] = data['sales'].shift(1)
data['Change'] = data['sales'] - data['yesterday_sales']
print('You can see clearly how sales are moving compared to yesterday.')
print(data)

You can see clearly how sales are moving compared to yesterday.
   day  sales  yesterday_sales  Change
0    1    100              NaN     NaN
1    2    120            100.0    20.0
2    3     90            120.0   -30.0
3    4    150             90.0    60.0
4    5    130            150.0   -20.0

In [51]:
data = pd.DataFrame({
    "day": [1, 2, 3, 4, 5],
    "sales": [100, 120, 90, 150, 130]
})
data['yesterday_sales'] = data['sales'].shift(1)
data['Change'] = data['sales'] - data['yesterday_sales']
data['Growth'] = (data['sales'] / data['yesterday_sales'] - 1) * 100
data["tomorrow_sales"] = data["sales"].shift(-1)
print('You can see clearly how sales are moving compared to yesterday.')
print(data)

You can see clearly how sales are moving compared to yesterday.
   day  sales  yesterday_sales  Change     Growth  tomorrow_sales
0    1    100              NaN     NaN        NaN           120.0
1    2    120            100.0    20.0  20.000000            90.0
2    3     90            120.0   -30.0 -25.000000           150.0
3    4    150             90.0    60.0  66.666667           130.0
4    5    130            150.0   -20.0 -13.333333             NaN

In [52]:
# .shift() helps you build yesterday vs today vs tomorrow comparisons
stocks = pd.DataFrame({
    'Day': [1,2,3,4,5,6,7,8,9,10],
    'Price': [100,200,300,400,500,600,700,800,900,1000]
})
stocks['Yesterday_price'] = stocks['Price'].shift(1)
stocks['return'] = (stocks['Price'] / stocks['Yesterday_price'] - 1) * 100
print(stocks)

   Day  Price  Yesterday_price      return
0    1    100              NaN         NaN
1    2    200            100.0  100.000000
2    3    300            200.0   50.000000
3    4    400            300.0   33.333333
4    5    500            400.0   25.000000
5    6    600            500.0   20.000000
6    7    700            600.0   16.666667
7    8    800            700.0   14.285714
8    9    900            800.0   12.500000
9   10   1000            900.0   11.111111

- How do you perform a cross-tabulation using crosstab inn pandas.

In [53]:
data = pd.DataFrame({
    'Gender': ['Male', 'Female', 'Female', 'Female', 'Male', 'Male'],
    'Preference': ['Tea', 'Coffey', 'Coffey', 'Tea', 'Tea', 'Coffey']
})
table = pd.crosstab(data['Gender'], data['Preference'])
print(table)

Preference  Coffey  Tea
Gender
Female           2    1
Male             1    2

- How do you compute the correlation between column in a dataframe.

In [54]:
# Correlation helps you find relationships between variables.
data = pd.DataFrame({
    'sales': [100, 120, 90, 150, 130],
    'Profit': [20, 25, 18, 35, 30]
})
print(data.corr())
print(data['sales'].corr(data['Profit']))

           sales    Profit
sales   1.000000  0.993238
Profit  0.993238  1.000000
0.9932380540249528

- How do you style to highlight specific values in a dataframe for visualization?

In [55]:
data = pd.DataFrame({
    'sales': [100, 120, 90, 150, 130],
    'Profit': [20, 25, 18, 35, 30]
})
# data.style.highlight_max(color='lightgreen')
# data.style.highlight_min(color='darkgreen')
data.style.highlight_max(color='lightcoral').highlight_min(color='darkgreen')

-  How do you efficiently apply a function to a large dataFrame using vectorized operations instead of apply.

In [56]:
# If you want to square each number, you might do:
data = pd.DataFrame({
    'A': [1,2,3,4,5,6,7,8,9,10]
})
data['A_squared'] = data['A'].apply(lambda x:  x ** 2)
print(data)

    A  A_squared
0   1          1
1   2          4
2   3          9
3   4         16
4   5         25
5   6         36
6   7         49
7   8         64
8   9         81
9  10        100

In [57]:
# What vectorized operations are
# Instead of looping one by one, vectorized operations let you do the calculation on all numbers at once:
data['A_squared'] = data['A'] ** 2
print(data)
# No loop is needed.
# The result is exactly the same as apply, but much faster.

    A  A_squared
0   1          1
1   2          4
2   3          9
3   4         16
4   5         25
5   6         36
6   7         49
7   8         64
8   9         81
9  10        100

In [58]:
# More examples
data = pd.DataFrame({
    'A': [1,2,3,4,5,6,7,8,9,10]
})
data['A_plus_5'] = data['A'].apply(lambda x: x + 5)
print(data)

    A  A_plus_5
0   1         6
1   2         7
2   3         8
3   4         9
4   5        10
5   6        11
6   7        12
7   8        13
8   9        14
9  10        15

In [59]:
data = pd.DataFrame({
    'A': [1,2,3,4,5,6,7,8,9,10]
})
data['A_plus_5'] = data['A'] + 5
print(data)

    A  A_plus_5
0   1         6
1   2         7
2   3         8
3   4         9
4   5        10
5   6        11
6   7        12
7   8        13
8   9        14
9  10        15

- How do you use memory usuage in a dataframe by downcasting numeric types.

In [62]:
df1 = pd.DataFrame({
    'emp_id': [1,2,3,4,5],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'age': [25,34,54,18,32],
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney'],
    'dept': ['HR', 'IT', 'Finance', 'HR', 'IT'],
    'join_date': ['2020-6-18', '2024-8-12', '2025-5-17', '2020-6-20', '2018-9-30']
})
df3 = pd.DataFrame({
    'date': pd.date_range(start = '2023-01-01', end = '2023-12-31' , freq = 'D'),
    'sales': np.random.randint(100,1000,365),
    'store_id': np.random.choice(['A', 'B', 'C'], 365)
})

In [63]:
print("Memory usage of df1 (per column):")
print(df1.memory_usage(deep=True))

print("\nMemory usage of df3 (per column):")
print(df3.memory_usage(deep=True))

Memory usage of df1 (per column):
Index        128
emp_id        40
name         309
age           40
city         315
dept         300
join_date    330
dtype: int64

Memory usage of df3 (per column):
Index         128
date         2920
sales        1460
store_id    21170
dtype: int64

In [64]:
print("\nTotal memory of df1:", df1.memory_usage(deep=True).sum(), "bytes")
print("Total memory of df3:", df3.memory_usage(deep=True).sum(), "bytes")

Total memory of df1: 1462 bytes
Total memory of df3: 25678 bytes

- How do you query to filter a dataframe efficiently.

In [77]:
data = pd.DataFrame({
    'A': np.random.randint(1, 100, 10),
    'B': np.random.randint(1, 100, 10),
    'C': np.random.randint(1, 100, 10)
})
print(data)

    A   B   C
0   1   6  62
1  57  46  70
2   2  98  63
3  93  76  79
4  11  52  34
5  67  14  79
6   9  57  63
7  43  25  81
8  28  33  66
9  98  17  49

In [78]:
print(data.query("A > 50 and B < 30"))

    A   B   C
5  67  14  79
9  98  17  49